# St7SetMovingLoadAutoDivisions

Sets the option to use load path divisions appropriate for the timesteps for a given load path.

long St7SetMovingLoadAutoDivisions(long uID, long LoadPathID, bool Enabled)

Input Parameters

uID

Strand7 model file ID.

LoadPathID

Load path ID.

Enabled

True to allow the solver to set load path divisions.

Strand7 API Manual